# Apply

In [ ]:

import numpy as np
import pandas as pd

In [ ]:
df = pd.DataFrame(
    {'number1': [10, 20],
     'number2': [100, 200]}
 )

print(df)

# create function
def increment(x):
    return x + 50

# call the function
increment(10)  # 10 + 50 = 60

# use the function on the dataframe
df2 = df.apply(increment)
df2

# Alternative: Using a lamda function on the dataframe
df3 = df.apply(lambda x: x + 50)
df3


# Using numpy function on the dataframe
df4 = df.apply(np.sum, axis=0)  # sum over the columns
df4

# Applymap
apply function element-wise

In [27]:
import pandas as pd

# Creating a DataFrame from a dictionary
df = pd.DataFrame({
    'name': ['Thomas', 'Ingo', 'Sara'],
    'city': ['berlin', 'hamBurg', 'stuttGART']
})

df_upper = df.applymap(str.upper)
# df_upper = df.apply(str.upper)

df_upper.head()

C:\Users\KaJur\AppData\Local\Temp\ipykernel_16040\2303455656.py:9: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_upper = df.applymap(str.upper)

     name       city
0  THOMAS     BERLIN
1    INGO    HAMBURG
2    SARA  STUTTGART

# Group by

In [28]:
participants = [
    (10,'thomas',40,'Berlin',77),
    (11,'Ingo',40,'Berlin',80),
    (12,'Sara',40,'Berlin',90),
    (13,'Lena',30,'Frankfurt',70),
    (14,'Julia',30,'Berlin',77),
    (15,'Frank',20,'Stuttgart',78),
    (16,'Matthias',20,'Aachen',77),
    (17,'Ali',40,'Aachen',90),
    (18,'timo',40,'Stuttgart',77),
    (19,'Steffi',40,'Stuttgart',77),
]

# create a Dataframe
df = pd.DataFrame(participants, columns= ['ID', 'name', 'age', 'city', 'score'])
df

# set the index
df.set_index('ID', inplace=True)
df

        name  age       city  score
ID
10    thomas   40     Berlin     77
11      Ingo   40     Berlin     80
12      Sara   40     Berlin     90
13      Lena   30  Frankfurt     70
14     Julia   30     Berlin     77
15     Frank   20  Stuttgart     78
16  Matthias   20     Aachen     77
17       Ali   40     Aachen     90
18      timo   40  Stuttgart     77
19    Steffi   40  Stuttgart     77

In [29]:
# create groups based on a column
groups = df.groupby('city')
groups  # <pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000020B937754C0>

# loop over the groups
for group in groups:
    print(group, '\n')

('Aachen',         name  age    city  score
ID
16  Matthias   20  Aachen     77
17       Ali   40  Aachen     90)

('Berlin',       name  age    city  score
ID
10  thomas   40  Berlin     77
11    Ingo   40  Berlin     80
12    Sara   40  Berlin     90
14   Julia   30  Berlin     77)

('Frankfurt',     name  age       city  score
ID
13  Lena   30  Frankfurt     70)

('Stuttgart',       name  age       city  score
ID
15   Frank   20  Stuttgart     78
18    timo   40  Stuttgart     77
19  Steffi   40  Stuttgart     77)

In [30]:
# loop over the groups; improved
for group_name, rows in groups:
    print('Group Name: ', group_name,)
    print('Group Rows: ')
    print(rows, '\n')

Group Name:  Aachen
Group Rows:
        name  age    city  score
ID
16  Matthias   20  Aachen     77
17       Ali   40  Aachen     90

Group Name:  Berlin
Group Rows:
      name  age    city  score
ID
10  thomas   40  Berlin     77
11    Ingo   40  Berlin     80
12    Sara   40  Berlin     90
14   Julia   30  Berlin     77

Group Name:  Frankfurt
Group Rows:
    name  age       city  score
ID
13  Lena   30  Frankfurt     70

Group Name:  Stuttgart
Group Rows:
      name  age       city  score
ID
15   Frank   20  Stuttgart     78
18    timo   40  Stuttgart     77
19  Steffi   40  Stuttgart     77

In [31]:
# Get the count of the rows of each group
groups.size()

# Aggregate functions
mean_values = groups.mean(numeric_only=True)
mean_values

# do aggregation functions on each column spearately 
results = groups.agg(
    {
        'age': 'mean',
        'score': 'sum'
    }
)

results = groups['age'].agg(['sum', 'mean', 'max'])
results = groups[['age', 'score']].agg(['sum', 'mean', 'max'])
results

           age                score
           sum       mean max   sum       mean max
city
Aachen      60  30.000000  40   167  83.500000  90
Berlin     150  37.500000  40   324  81.000000  90
Frankfurt   30  30.000000  30    70  70.000000  70
Stuttgart  100  33.333333  40   232  77.333333  78

# Date Time in Pandas

In [42]:
# create a Dataframe

df = pd.DataFrame(
    {
        'date': ['20/12/2023', '30/11/2023', '23/04/2021'],
        'score': [30, 35, 21]
    }
)

df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   score   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

         date  score
0  20/12/2023     30
1  30/11/2023     35
2  23/04/2021     21

In [43]:
# convert the data column to date Type
df['date'] = pd.to_datetime(df['date'])
df.info()

df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   score   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 176.0 bytes

C:\Users\KaJur\AppData\Local\Temp\ipykernel_16040\1239113148.py:2: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['date'] = pd.to_datetime(df['date'])

        date  score
0 2023-12-20     30
1 2023-11-30     35
2 2021-04-23     21

In [46]:
# add a column to a Dataframe
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['day'] = df['date'].dt.day
df['day_name'] = df['date'].dt.day_name()
df['day_of_the_week'] = df['date'].dt.day_of_week
df

        date  score  year  month  day   day_name  day_of_the_week
0 2023-12-20     30  2023     12   20  Wednesday                2
1 2023-11-30     35  2023     11   30   Thursday                3
2 2021-04-23     21  2021      4   23     Friday                4

In [49]:
# Map new data to Date Time
date_mapping = {
    0: 'Montag',
    1: 'Dienstag',
    2: 'Mittwoch',
    3: 'Donnerstag',
    4: 'Freitag',
    5: 'Samstag',
    6: 'Sonntag'
}

# map the values from pandas to my dictionary
df['day_name_DE'] = df['date'].dt.day_of_week.map(date_mapping)

# Alteranative
df['day_name_DE'] = df['day_of_the_week'].map(date_mapping)
df

        date  score  year  month  day   day_name  day_of_the_week day_name_DE
0 2023-12-20     30  2023     12   20  Wednesday                2    Mittwoch
1 2023-11-30     35  2023     11   30   Thursday                3  Donnerstag
2 2021-04-23     21  2021      4   23     Friday                4     Freitag